org/main/20211007013434-cpt103.org
:PROPERTIES:
:ID:       1C716C73-DC8E-45EA-A998-42DDE75C338D
:CATEGORY: CPT103
:END:
#+title: CPT103
#+HUGO_SECTION:main
* COMPLETED CPT103                                                   :agenda:
CLOSED: [2022-01-03 Mon 15:25]
* Class Information
:LOGBOOK:
CLOCK: [2021-10-11 Mon 14:20]--[2021-10-11 Mon 14:42] =>  0:22
:END:
  *CPT103* is of Database.
  The class. I seemed to be missing a lot. Got to see that Again
** Credits - 5
| num | Method   | rnage | time |  % |
|   1 | LMo test |       |      | 15 |
|   2 | LMO test |       |      | 15 |
|   3 | Project  |       |      | 70 |
** Professor Info
*** Jianjun Chen
**** Contact
+ email(prefer): jianjun.chen@xjtlu.edu.cn
+ office tele:0512-81889137
+ Office hour: SD541 Tuesday 16:00-18:00
** Course Content Info
*** [[id:DC5167CD-BFBC-4DE3-8B89-7E1ABFCA6433][SQL]]
**** Data Def
**** Queries
*** Entity-relationship modeling
*** Normalisation
*** Transactions
*** Relational algebra
** Module Specific Info
*** Database Server
**** Type
DB server: MySqL
Client for labs: PhpMyAdmin
**** Logging Info
+ Address: csse-mysql.xjtlu.edu.cn
+ condition: XJTLU wifi or VPN
+ Account
  + accountname: LinfengHe20
  + password: 123
* Resources
** Lecture slide
** Online Resoureces
* Tutoring Schedule
** DONE Lecture EB138
DEADLINE: <2021-12-24 Fri> SCHEDULED: <2021-11-29 Mon 16:00-18:00 +1w>--<2021-12-24 Fri>
:PROPERTIES:
:LAST_REPEAT: [2021-11-24 Wed 12:12]
:END:
:LOGBOOK:
- State "DONE"       from ""           [2021-11-24 Wed 12:12]
- State "DONE"       from              [2021-11-24 Wed 12:12]
- State "DONE"       from ""           [2021-11-24 Wed 12:10]
- State "DONE"       from              [2021-11-24 Wed 12:10]
- State "DONE"       from ""           [2021-11-09 Tue 22:57]
- State "DONE"       from              [2021-11-09 Tue 22:57]
- State "DONE"       from ""           [2021-11-02 Tue 00:00]
- State "DONE"       from              [2021-11-02 Tue 00:00]
- State "DONE"       from ""           [2021-11-01 Mon 12:39]
- State "DONE"       from              [2021-11-01 Mon 12:39]
- State "DONE"       from ""           [2021-11-01 Mon 12:39]
- State "DONE"       from              [2021-11-01 Mon 12:39]
- State "DONE"       from              [2021-10-14 Thu 15:54]
:END:
** DONE Comp. Lab SC464
SCHEDULED: <2021-11-25 Thu 17:00-18:00 +1w>
:PROPERTIES:
:LAST_REPEAT: [2021-11-24 Wed 12:10]
:END:
:LOGBOOK:
- State "DONE"       from ""           [2021-11-24 Wed 12:10]
- State "DONE"       from              [2021-11-24 Wed 12:10]
- State "DONE"       from ""           [2021-11-12 Fri 16:58]
- State "DONE"       from              [2021-11-12 Fri 16:58]
- State "DONE"       from ""           [2021-11-09 Tue 22:56]
- State "DONE"       from              [2021-11-09 Tue 22:56]
- State "DONE"       from ""           [2021-11-01 Mon 12:41]
- State "DONE"       from              [2021-11-01 Mon 12:41]
- State "DONE"       from ""           [2021-11-01 Mon 12:41]
- State "DONE"       from              [2021-11-01 Mon 12:41]
- State "DONE"       from ""           [2021-10-16 Sat 12:18]
:END:
on week 5,6,8-11
* Tasks
** DONE Preview #1
SCHEDULED: <2021-11-27 Sat +1w>
:PROPERTIES:
:LAST_REPEAT: [2021-11-24 Wed 12:13]
:END:
:LOGBOOK:
- State "DONE"       from ""           [2021-11-24 Wed 12:13]
- State "DONE"       from              [2021-11-24 Wed 12:13]
- State "DONE"       from ""           [2021-11-24 Wed 12:12]
- State "DONE"       from              [2021-11-24 Wed 12:12]
- State "DONE"       from ""           [2021-11-09 Tue 22:57]
- State "DONE"       from              [2021-11-09 Tue 22:57]
- State "DONE"       from ""           [2021-11-09 Tue 22:55]
- State "DONE"       from              [2021-11-09 Tue 22:55]
- State "DONE"       from ""           [2021-11-01 Mon 14:10]
- State "DONE"       from              [2021-11-01 Mon 14:10]
- State "DONE"       from ""           [2021-11-01 Mon 14:10]
- State "DONE"       from              [2021-11-01 Mon 14:10]
:END:
*** Preview session W6

** DONE Preview #2
SCHEDULED: <2021-11-23 Tue +1w>
:PROPERTIES:
:LAST_REPEAT: [2021-11-24 Wed 12:13]
:END:
:LOGBOOK:
- State "DONE"       from ""           [2021-11-24 Wed 12:13]
- State "DONE"       from              [2021-11-24 Wed 12:13]
- State "DONE"       from ""           [2021-11-24 Wed 12:12]
- State "DONE"       from              [2021-11-24 Wed 12:12]
- State "DONE"       from ""           [2021-11-24 Wed 12:10]
- State "DONE"       from              [2021-11-24 Wed 12:10]
- State "DONE"       from ""           [2021-11-12 Fri 16:58]
- State "DONE"       from              [2021-11-12 Fri 16:58]
- State "DONE"       from ""           [2021-11-09 Tue 22:55]
- State "DONE"       from              [2021-11-09 Tue 22:55]
- State "DONE"       from ""           [2021-10-16 Sat 12:18]
:END:
*** Preview session W5
  
** DONE Coursework project
CLOSED: [2021-12-22 Wed 17:32]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2021-12-22 Wed 17:32]
:END:
** DONE Class content Mindmap
CLOSED: [2021-12-29 Wed 00:43] SCHEDULED: <2021-10-12 Tue>
:LOGBOOK:
- State "DONE"       from "WEEK"       [2021-12-29 Wed 00:43]
:END:
   I have little conscious understanding about the topic.
   I need to make a mindmap out of the syllabus, and what I know.
   Structural
** TODO Catch up [3/7]
:PROPERTIES:
:Effort:   2:00
:END:
SCHEDULED: <2021-11-22 Mon>
:LOGBOOK:
CLOCK: [2021-11-22 Mon 14:57]--[2021-11-22 Mon 15:30] =>  0:33
CLOCK: [2021-11-22 Mon 14:15]--[2021-11-22 Mon 14:51] =>  0:36
CLOCK: [2021-11-22 Mon 13:36]--[2021-11-22 Mon 14:08] =>  0:32
:END:
+ [X] ER modeling whole
+ [X] ER modeling detail
+ [X] Normalisation whole
+ [ ] Normalisation detail
+ [ ] Coursework check
+ [ ] Coursework past check
+ [ ] Coursework planning.
*** Session
4 of 30m
*** Strategy
:PROPERTIES:
:Effort:   2:00
:END:
ER modeling. Mindmap. Whole then detail.
Noramlisation. the same
** DONE Course Information CPT103
CLOSED: [2021-10-12 Tue 01:09] SCHEDULED: <2021-10-11 13:00-13:30 Mon>
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-10-12 Tue 01:09]
:END:
   Could use the approach in [[file:20211007013423-cpt107.org::*Course information][Course information]]. Could make a machine out of that.
   
** DONE SQL Catch up
CLOSED: [2021-10-12 Tue 01:09] SCHEDULED: <2021-10-11 13:30-14:30 Mon>
  :PROPERTIES:
  :Effort:   60
  :END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-10-12 Tue 01:09]
CLOCK: [2021-10-11 Mon 14:43]--[2021-10-11 Mon 16:41] =>  1:58
:END:
  I would say with pity that I'm left behind a little bit in the course.
  The content would definitely be in my range, but I still have to learn them to have them, and I need to be reliable and at least following the module's schedule.
  The Approach is:
  1. I read a tutorial
  2. I write paper note
  3. I do exercise
  4. I write org-roam node [[id:DC5167CD-BFBC-4DE3-8B89-7E1ABFCA6433][SQL]]
  5. I go back to exercises.

  It's worth mention that this could be a reuseable machine for self-learning of other similar skills.
  For this task, do as this flow. In the future, could test on other flows like =that without paper note=

** TODO Do Labs [0/6]
:PROPERTIES:
:Effort:   3:00 
:END:
:LOGBOOK:
CLOCK: [2021-12-06 Mon 16:53]--[2021-12-06 Mon 17:18] =>  0:25
CLOCK: [2021-12-06 Mon 09:52]--[2021-12-06 Mon 10:32] =>  0:40
CLOCK: [2021-12-05 Sun 18:22]--[2021-12-05 Sun 19:02] =>  0:40
:END:
Do labs to ensure that I know everything nessasary
+ [ ] lab 1

  + [ ] Task 1

  + [ ] Task 2

  + [ ] Task 3

  + [ ] Task 4
  
+ [ ] lab 2
+ [ ] lab 3
+ [ ] lab 4
+ [ ] lab 5
+ [ ] lab 6
* Notes
| class  | instance |
| Schema | record   |

** Entity-Relation Modelling

*** Spec

**** from written requirement

**** What database going to be used for

**** what tables attributes keys areneeded

*** conponents

**** Entities
object
**** Attributes
property
**** Realtionships
link
Students-enrolment-modules
*** Entity-Relationship Diagrams
Conceptual view of the database
independent from the database
**** Diagram Conventions

***** Entities
+ Is a general type or class, ~Lecturer~, ~Module~
+ Have instances, ~Steven Guan~, ~CPT101~
+ have Attributes

****** Representation
rounded Box with label
***** Attributes
Have:
+ A name
+ an associated entity
+ domain of possible values
+ each instance, each value from domain
****** Representation
ovals linked to entity with  line
***** Relationship
have:
+ a name
+ a set of entities participating
+ a degree
  number of entities participating(2 for most cases)
+ a cardianlity ratio
****** Cardinality Ratios
******* 1:1
lecturer-unique office
******* 1:M
lecturer-many students
******* M:M
many students-many modules
****** Representation
Links between 2 entities. Name in a diamond box. End of link show cardinality(M or 1)
**** Designing ER Models

***** Identification
+ Entities
+ Attributes
+ Relations and Cardinality ratios

obtain them from problem des.
***** General guidelines

****** noun and verb
noun-entity/property
verb-relationship
