content/main/20211007013434-cpt103.md
+++
title = "CPT103"
author = ["System Administrator"]
draft = false
+++

## COMPLETED CPT103 <span class="tag"><span class="agenda">agenda</span></span> {#completed-cpt103}


## Class Information {#class-information}

**CPT103** is of Database.
The class. I seemed to be missing a lot. Got to see that Again


### Credits - 5 {#credits-5}

| num | Method   | rnage | time | %  |
|-----|----------|-------|------|----|
| 1   | LMo test |       |      | 15 |
| 2   | LMO test |       |      | 15 |
| 3   | Project  |       |      | 70 |


### Professor Info {#professor-info}


#### Jianjun Chen {#jianjun-chen}

<!--list-separator-->

-  Contact

    -   email(prefer): jianjun.chen@xjtlu.edu.cn
    -   office tele:0512-81889137
    -   Office hour: SD541 Tuesday 16:00-18:00


### Course Content Info {#course-content-info}


#### [SQL]({{< relref "20211007014803-sql.md" >}}) {#sql--20211007014803-sql-dot-md}

<!--list-separator-->

-  Data Def

<!--list-separator-->

-  Queries


#### Entity-relationship modeling {#entity-relationship-modeling}


#### Normalisation {#normalisation}


#### Transactions {#transactions}


#### Relational algebra {#relational-algebra}


### Module Specific Info {#module-specific-info}


#### Database Server {#database-server}

<!--list-separator-->

-  Type

    DB server: MySqL
    Client for labs: PhpMyAdmin

<!--list-separator-->

-  Logging Info

    -   Address: csse-mysql.xjtlu.edu.cn
    -   condition: XJTLU wifi or VPN
    -   Account
        -   accountname: LinfengHe20
        -   password: 123


## Resources {#resources}


### Lecture slide {#lecture-slide}


### Online Resoureces {#online-resoureces}


## Tutoring Schedule {#tutoring-schedule}


### <span class="org-todo done DONE">DONE</span> Lecture EB138 {#lecture-eb138}


### <span class="org-todo done DONE">DONE</span> Comp. Lab SC464 {#comp-dot-lab-sc464}

on week 5,6,8-11


## Tasks {#tasks}


### <span class="org-todo done DONE">DONE</span> Preview #1 {#preview-1}


#### Preview session W6 {#preview-session-w6}


### <span class="org-todo done DONE">DONE</span> Preview #2 {#preview-2}


#### Preview session W5 {#preview-session-w5}


### <span class="org-todo done DONE">DONE</span> Coursework project {#coursework-project}


### <span class="org-todo done DONE">DONE</span> Class content Mindmap {#class-content-mindmap}

I have little conscious understanding about the topic.
I need to make a mindmap out of the syllabus, and what I know.
Structural


### <span class="org-todo todo TODO">TODO</span> Catch up <code>[3/7]</code> {#catch-up}

SCHEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-11-22 Mon&gt;</span></span>

-   [X] ER modeling whole
-   [X] ER modeling detail
-   [X] Normalisation whole
-   [ ] Normalisation detail
-   [ ] Coursework check
-   [ ] Coursework past check
-   [ ] Coursework planning.


#### Session {#session}

4 of 30m


#### Strategy {#strategy}

ER modeling. Mindmap. Whole then detail.
Noramlisation. the same


### <span class="org-todo done DONE">DONE</span> Course Information CPT103 {#course-information-cpt103}

Could use the approach in [Course information]({{< relref "20211007013423-cpt107#course-information" >}}). Could make a machine out of that.


### <span class="org-todo done DONE">DONE</span> SQL Catch up {#sql-catch-up}

I would say with pity that I'm left behind a little bit in the course.
The content would definitely be in my range, but I still have to learn them to have them, and I need to be reliable and at least following the module's schedule.
The Approach is:

1.  I read a tutorial
2.  I write paper note
3.  I do exercise
4.  I write org-roam node [SQL]({{< relref "20211007014803-sql.md" >}})
5.  I go back to exercises.

It's worth mention that this could be a reuseable machine for self-learning of other similar skills.
For this task, do as this flow. In the future, could test on other flows like `that without paper note`


### <span class="org-todo todo TODO">TODO</span> Do Labs <code>[0/6]</code> {#do-labs}

Do labs to ensure that I know everything nessasary

-   [ ] lab 1
    -   [ ] Task 1

    -   [ ] Task 2

    -   [ ] Task 3

    -   [ ] Task 4

-   [ ] lab 2
-   [ ] lab 3
-   [ ] lab 4
-   [ ] lab 5
-   [ ] lab 6


## Notes {#notes}

| class  | instance |
|--------|----------|
| Schema | record   |


### Entity-Relation Modelling {#entity-relation-modelling}


#### Spec {#spec}

<!--list-separator-->

-  from written requirement

<!--list-separator-->

-  What database going to be used for

<!--list-separator-->

-  what tables attributes keys areneeded


#### conponents {#conponents}

<!--list-separator-->

-  Entities

    object

<!--list-separator-->

-  Attributes

    property

<!--list-separator-->

-  Realtionships

    link
    Students-enrolment-modules


#### Entity-Relationship Diagrams {#entity-relationship-diagrams}

Conceptual view of the database
independent from the database

<!--list-separator-->

-  Diagram Conventions

    <!--list-separator-->

    -  Entities

        -   Is a general type or class, `Lecturer`, `Module`
        -   Have instances, `Steven Guan`, `CPT101`
        -   have Attributes

        <!--list-separator-->

        -  Representation

            rounded Box with label

    <!--list-separator-->

    -  Attributes

        Have:

        -   A name
        -   an associated entity
        -   domain of possible values
        -   each instance, each value from domain

        <!--list-separator-->

        -  Representation

            ovals linked to entity with  line

    <!--list-separator-->

    -  Relationship

        have:

        -   a name
        -   a set of entities participating
        -   a degree
            number of entities participating(2 for most cases)
        -   a cardianlity ratio

        <!--list-separator-->

        -  Cardinality Ratios

            <!--list-separator-->

            -  1:1

                lecturer-unique office

            <!--list-separator-->

            -  1:M

                lecturer-many students

            <!--list-separator-->

            -  M:M

                many students-many modules

        <!--list-separator-->

        -  Representation

            Links between 2 entities. Name in a diamond box. End of link show cardinality(M or 1)

<!--list-separator-->

-  Designing ER Models

    <!--list-separator-->

    -  Identification

        -   Entities
        -   Attributes
        -   Relations and Cardinality ratios

        obtain them from problem des.

    <!--list-separator-->

    -  General guidelines

        <!--list-separator-->

        -  noun and verb

            noun-entity/property
            verb-relationship

        <!--list-separator-->
