org/main/20211007013434-cpt103.org
****** order: noun then verb
1. Find the nouns
2. Find the verbs of the interacton of these nouns
3. Draw entities
4. Draw each sentence of the nouns.
***** M:M relationships

****** Issue
Difficult to represent in a database
****** Solution
Split a M:M into 2 1:M with addtional entity like ~enrolment~
******* The enrolment
+ ~StudentID~ and ~courseCode~ (primary key in both M end entity)
+ foreign key to both entity
***** Entity and Relation

***** Entity and Attribute
+ Entities can have attributes but attributes have no smaller parts
+ Entities can have relationships between them, but an attribute belongs to a single entity
  Simple tree can use attribute
***** 1:1 relationship
would be redundent if:
+ it's 1:1 relationship on A and B
+ every A is to a B and every B is to an A
  it can be inversed
****** Solution
Merge them.
***** Steps

****** 1. Description of requirements
******* Identification
+ Entities
+ Attributes
+ Relations and Cardinality ratios

****** 2. Draw the ER Diagram and then

******* Merge 1:1

******* Split M:M

**** ER diagram to SQL Tables
Entity - table name
Attribute - column
Relationship - foreign key
**** Sunny Isle Hotel example

***** 1. Entities and Attributes

***** 2. RElationship

***** 3. Design Issues

** Normalisation

*** Feature of Good DB design
+ Minimal attributes
+ Find close attributes in one place
+ Minimal Redundancy
  except foreign keys,each attributes represented only once
*** Normalisation-Defi
re-organise data in to tables to minimise data redundancy
*** Data Redundancy

**** Problems

***** Memory usage

***** Update Anomalies
insert, delete, change of repeated informations
*** Re-organise Tables

**** Observing Table Data
see properties:
+ 1:1 - same table
+ 1:M - different tables
  find the 1:1 properties, and find them a entity to group them
+ M:M 
**** Functional Dependency
each A would map into a B.
 M A - 1 B
 1 A - 1 B
all involved Functional dependency could make a good table, with the determinant being the unique key
**** Fall and Partial FD

***** Determinants in Full/Partial FD

****** Full
candidate key if we split the table

****** partial
super keys

**** Transitie Dependency

*** Normal Form

*** The process of normalisation

**** First Normal Form
all values are atomic.
not atomic,like (T1,T2) will be UNF
***** Problem with UNF

**** Normalise to 1NF
1. Flatten the table
2. reassign primary/unique key (module,text)

1. or, use a seperate relation. 
***** Problem in 1NF
adding and modifying
**** Second Normal Form
1NF with no partially dependency of primary key.
This difference occurs often in repeating in the flattened 1NF table.
***** 1NF to 2NF
Split
**** Third Normal Form 3NF
2NF with no transitive dependency on primary key
***** 2NF to 3NF

***** Problems resolved in 3NF

**** Transitive Dependency and FK 

**** Practice Example

* Assesments

** DONE Assesment 3
CLOSED: [2021-12-24 Fri 01:16] DEADLINE: <2021-12-13 Mon 23:59>
:LOGBOOK:
- State "DONE"       from "DONE"       [2021-12-24 Fri 01:16]
- State "DONE"       from              [2021-12-24 Fri 01:16]
:END:
Max delay is 12-17
*** Submission
**** Format
Everything packed into =2034693_Linfeng_He.zip=

inside =2034693_Linfeng_He.zip= are =report.pdf= and =script.sql
**** Location
Submit to lmo's Dropbox:[the link]
*** Task and Marking criteria
**** Create Database
***** TODO Script Work
:LOGBOOK:
CLOCK: [2021-12-13 Mon 19:37]--[2021-12-13 Mon 20:20] =>  0:43
:END:
***** TODO ER Modeling
writing the ER modeling explanation

**** Use cases
to accomplish each use case, seperate data and screenshot.
I need test data to think in a fixed way. otherwise I can't think. So make test data first.
***** Asked[8/9]
****** DONE alert phone
CLOSED: [2021-12-14 Tue 23:06]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-12-14 Tue 23:06]
CLOCK: [2021-12-14 Tue 16:58]--[2021-12-14 Tue 17:04] =>  0:06
CLOCK: [2021-12-14 Tue 13:08]--[2021-12-14 Tue 14:50] =>  1:42
:END:
https://www.cnblogs.com/werewolfBoy/p/11429973.html
check on every record in between mark's
+ [-] Test data
  + [X] Districts
  + [ ] record
    + [ ] 233636
    + [ ] 233635
    + [ ] 233634
+ [ ] Select
+ [ ] screenshot
****** DONE G""PS[3/3]
CLOSED: [2021-12-13 Mon 23:36]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-12-13 Mon 23:36]
CLOCK: [2021-12-13 Mon 21:28]--[2021-12-13 Mon 23:36] =>  2:08
CLOCK: [2021-12-13 Mon 19:21]--[2021-12-13 Mon 19:37] =>  0:16
CLOCK: [2021-12-13 Mon 17:00]--[2021-12-13 Mon 19:12] =>  1:00
:END:
the nearest base

+ [X] make the insert statement
+ [X] Make the data
  + [X] 做数据的方法
  + [X] record
    + [X] 233636之前的两次记录
  + [X] base_station
    + [X] 一份全的bases_station记录
    + [X] district
  + [X] current_timestamp in insert
+ [X] take the screenshot
****** DONE Least report generate time[3/3]
:LOGBOOK:
CLOCK: [2021-12-14 Tue 15:42]--[2021-12-14 Tue 16:29] =>  0:47
:END:
+ [X] Test data
  + [X] Foreignkeys
  + [X] tests
    different date_sub(now(),interval x minutes) in test time and report time
    9
+ [X] Select statement
  + [X] 
+ [X] Screenshot
****** DONE citizens with viral test in a period
CLOSED: [2021-12-14 Tue 23:06]
:LOGBOOK:
- State "DONE"       from "WEEK"       [2021-12-14 Tue 23:06]
CLOCK: [2021-12-14 Tue 17:04]--[2021-12-14 Tue 23:06] =>  6:02
CLOCK: [2021-12-14 Tue 16:29]--[2021-12-14 Tue 16:58] =>  0:29
:END:
+ [X] TEST DATA
  + [X] patient 13[4/4]
    + [X] patients
    + [X] before
      + [X] 2 time all before
        + [X] bigger gap
        + [X] smaller gap
      + [X] 2 tiem 1 before 1 after
      + [X] 2 time 1 before, 1 in
        + [X] bigger gap
        + [X] smaller gap
      + [X] 1 time before
    + [X] after
      + [X] 2 time all after
        + [X] bigger gap
        + [X] smaller gap
      + [X] 2 time, 1 in 1 after
        + [X] bigger gap
        + [X] smaller gap
      + [X] 1 time after
    + [X] both in the time
      + [X] 2 time with bigger gap
      + [X] 2 time with smaller gap
  + [X] test
    + [X] collect date
+ [ ] statement
+ [ ] screenshot
****** DONE Risk billboard
CLOSED: [2021-12-15 Wed 08:18]
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-12-15 Wed 08:18]
:END:
****** DONE test data checklist generator [0/3]
CLOSED: [2021-12-15 Wed 09:19]
:PROPERTIES:
:Effort:   30
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-12-15 Wed 09:19]
CLOCK: [2021-12-15 Wed 08:31]--[2021-12-15 Wed 09:01] =>  0:30
:END:
+ [ ] =+ [ ]= syntax
+ [ ] /n at the end of a line
+ [ ] all cases
  + [ ] flipping every possibility
    input: a[0:10], a[0]=[possibility1, possibility2,...,possibilityn]
