content/main/20211007013434-cpt103.md

        -  order: noun then verb

            1.  Find the nouns
            2.  Find the verbs of the interacton of these nouns
            3.  Draw entities
            4.  Draw each sentence of the nouns.

    <!--list-separator-->

    -  M:M relationships

        <!--list-separator-->

        -  Issue

            Difficult to represent in a database

        <!--list-separator-->

        -  Solution

            Split a M:M into 2 1:M with addtional entity like `enrolment`

            <!--list-separator-->

            -  The enrolment

                -   `StudentID` and `courseCode` (primary key in both M end entity)
                -   foreign key to both entity

    <!--list-separator-->

    -  Entity and Relation

    <!--list-separator-->

    -  Entity and Attribute

        -   Entities can have attributes but attributes have no smaller parts
        -   Entities can have relationships between them, but an attribute belongs to a single entity
            Simple tree can use attribute

    <!--list-separator-->

    -  1:1 relationship

        would be redundent if:

        -   it's 1:1 relationship on A and B
        -   every A is to a B and every B is to an A
            it can be inversed

        <!--list-separator-->

        -  Solution

            Merge them.

    <!--list-separator-->

    -  Steps

        <!--list-separator-->

        -  1. Description of requirements

            <!--list-separator-->

            -  Identification

                -   Entities
                -   Attributes
                -   Relations and Cardinality ratios

        <!--list-separator-->

        -  2. Draw the ER Diagram and then

            <!--list-separator-->

            -  Merge 1:1

            <!--list-separator-->

            -  Split M:M

<!--list-separator-->

-  ER diagram to SQL Tables

    Entity - table name
    Attribute - column
    Relationship - foreign key

<!--list-separator-->

-  Sunny Isle Hotel example

    <!--list-separator-->

    -  1. Entities and Attributes

    <!--list-separator-->

    -  2. RElationship

    <!--list-separator-->

    -  3. Design Issues


### Normalisation {#normalisation}


#### Feature of Good DB design {#feature-of-good-db-design}

-   Minimal attributes
-   Find close attributes in one place
-   Minimal Redundancy
    except foreign keys,each attributes represented only once


#### Normalisation-Defi {#normalisation-defi}

re-organise data in to tables to minimise data redundancy


#### Data Redundancy {#data-redundancy}

<!--list-separator-->

-  Problems

    <!--list-separator-->

    -  Memory usage

    <!--list-separator-->

    -  Update Anomalies

        insert, delete, change of repeated informations


#### Re-organise Tables {#re-organise-tables}

<!--list-separator-->

-  Observing Table Data

    see properties:

    -   1:1 - same table
    -   1:M - different tables
        find the 1:1 properties, and find them a entity to group them
    -   M:M

<!--list-separator-->

-  Functional Dependency

    each A would map into a B.
     M A - 1 B
     1 A - 1 B
    all involved Functional dependency could make a good table, with the determinant being the unique key

<!--list-separator-->

-  Fall and Partial FD

    <!--list-separator-->

    -  Determinants in Full/Partial FD

        <!--list-separator-->

        -  Full

            candidate key if we split the table

        <!--list-separator-->

        -  partial

            super keys

<!--list-separator-->

-  Transitie Dependency


#### Normal Form {#normal-form}


#### The process of normalisation {#the-process-of-normalisation}

<!--list-separator-->

-  First Normal Form

    all values are atomic.
    not atomic,like (T1,T2) will be UNF

    <!--list-separator-->

    -  Problem with UNF

<!--list-separator-->

-  Normalise to 1NF

    1.  Flatten the table
    2.  reassign primary/unique key (module,text)

    3.  or, use a seperate relation.

    <!--list-separator-->

    -  Problem in 1NF

        adding and modifying

<!--list-separator-->

-  Second Normal Form

    1NF with no partially dependency of primary key.
    This difference occurs often in repeating in the flattened 1NF table.

    <!--list-separator-->

    -  1NF to 2NF

        Split

<!--list-separator-->

-  Third Normal Form 3NF

    2NF with no transitive dependency on primary key

    <!--list-separator-->

    -  2NF to 3NF

    <!--list-separator-->

    -  Problems resolved in 3NF

<!--list-separator-->

-  Transitive Dependency and FK

<!--list-separator-->

-  Practice Example


## Assesments {#assesments}


### <span class="org-todo done DONE">DONE</span> Assesment 3 {#assesment-3}

Max delay is 12-17


#### Submission {#submission}

<!--list-separator-->

-  Format

    Everything packed into `2034693_Linfeng_He.zip`

    inside `2034693_Linfeng_He.zip` are `report.pdf` and =script.sql

<!--list-separator-->

-  Location

    Submit to lmo's Dropbox:[the link]


#### Task and Marking criteria {#task-and-marking-criteria}

<!--list-separator-->

-  Create Database

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  Script Work

    <!--list-separator-->

    - <span class="org-todo todo TODO">TODO</span>  ER Modeling

        writing the ER modeling explanation

<!--list-separator-->

-  Use cases

    to accomplish each use case, seperate data and screenshot.
    I need test data to think in a fixed way. otherwise I can't think. So make test data first.

    <!--list-separator-->

    -  Asked<code>[8/9]</code>

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  alert phone

            <https://www.cnblogs.com/werewolfBoy/p/11429973.html>
            check on every record in between mark's

            -   [-] Test data
                -   [X] Districts
                -   [ ] record
                    -   [ ] 233636
                    -   [ ] 233635
                    -   [ ] 233634
            -   [ ] Select
            -   [ ] screenshot

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  G""PS<code>[3/3]</code>

            the nearest base

            -   [X] make the insert statement
            -   [X] Make the data
                -   [X] 做数据的方法
                -   [X] record
                    -   [X] 233636之前的两次记录
                -   [X] base_station
                    -   [X] 一份全的bases_station记录
                    -   [X] district
                -   [X] current_timestamp in insert
            -   [X] take the screenshot

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  Least report generate time<code>[3/3]</code>

            -   [X] Test data
                -   [X] Foreignkeys
                -   [X] tests
                    different date_sub(now(),interval x minutes) in test time and report time
                    9
            -   [X] Select statement
                -   [X]
            -   [X] Screenshot

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  citizens with viral test in a period

            -   [X] TEST DATA
                -   [X] patient 13<code>[4/4]</code>
                    -   [X] patients
                    -   [X] before
                        -   [X] 2 time all before
                            -   [X] bigger gap
                            -   [X] smaller gap
                        -   [X] 2 tiem 1 before 1 after
                        -   [X] 2 time 1 before, 1 in
                            -   [X] bigger gap
                            -   [X] smaller gap
                        -   [X] 1 time before
                    -   [X] after
                        -   [X] 2 time all after
                            -   [X] bigger gap
                            -   [X] smaller gap
                        -   [X] 2 time, 1 in 1 after
                            -   [X] bigger gap
                            -   [X] smaller gap
                        -   [X] 1 time after
                    -   [X] both in the time
                        -   [X] 2 time with bigger gap
                        -   [X] 2 time with smaller gap
                -   [X] test
                    -   [X] collect date
            -   [ ] statement
            -   [ ] screenshot

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  Risk billboard

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  test data checklist generator <code>[0/3]</code>

            -   [ ] `+ [ ]` syntax
            -   [ ] /n at the end of a line
            -   [ ] all cases
                -   [ ] flipping every possibility
                    input: a[0:10], a[0]=[possibility1, possibility2,...,possibilityn]

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  positive from a district <code>[4/4]</code>

            -   [X] data in
                -   [X] districts
                -   [X] test
                -   [X] record
                -   [X] patient
                -   [X] base_station
