org/main/20211007013434-cpt103.org
****** DONE positive from a district [4/4]
CLOSED: [2021-12-15 Wed 13:04]
:PROPERTIES:
:Effort:   30
:END:
:LOGBOOK:
- State "DONE"       from "TODO"       [2021-12-15 Wed 13:04]
CLOCK: [2021-12-15 Wed 09:23]--[2021-12-15 Wed 11:16] =>  1:53
:END:
+ [X] data in
  + [X] districts
  + [X] test
  + [X] record
  + [X] patient
  + [X] base_station
    
+ [X] Test data 8 cases in 
  + [X] positivein Con 2021-10-04
  + [X] positivein Cnot on 2021-10-04
  + [X] positivenot in Con 2021-10-04
  + [X] positivenot in Cnot on 2021-10-04
  + [X] negativein Con 2021-10-04
  + [X] negativein Cnot on 2021-10-04
  + [X] negativenot in Con 2021-10-04
  + [X] negativenot in Cnot on 2021-10-04
+ [X] select statement
  + [X] period chart
  + [X] 对齐
  + [X] make sure the man's positive
  + [X] make sure the man's in centre lukewarm
  + [X] make sure the man's collected at 2021-10-04
+ [X] screenshot
****** DONE increment in a district
CLOSED: [2021-12-15 Wed 14:02]
:PROPERTIES:
:Effort:   30
:END:
:LOGBOOK:
- State "DONE"       from "WEEK"       [2021-12-15 Wed 14:02]
CLOCK: [2021-12-15 Wed 13:05]--[2021-12-15 Wed 13:48] =>  0:43
:END:
+ [X] test dat a
+ [ ] select
  + [ ] all positive in 1 day
  + [ ] count()
  + [ ] minus
+ [ ] screenshot
****** TODO Spread rate
:LOGBOOK:
CLOCK: [2021-12-15 Wed 14:04]--[2021-12-15 Wed 15:43] =>  1:39
:END:
+ [ ] test data
+ [ ] select
+ [ ] screenshot
***** Self-generated[0/2]
Try have 2 tables placed together, and make some sence out of it.
Inovation is a synonym for traversing through every possiblity.
****** TODO How like to wander 1 people can be
****** TODO How like to wander 1 district/region can be.
** DONE Assesment 1 and 2
CLOSED: [2021-12-13 Mon 16:51] DEADLINE: <2021-12-09 Thu 19:00-21:00>
:LOGBOOK:
- State "DONE"       from              [2021-12-13 Mon 16:51]
:END:

* Labs

* Questions

** TODO What's super key?
Candidate key + other things
** TODO Why is super key bad?
other things aren't nessasary
** TODO How to set a column unique and remove?

** TODO select distinct?
