content/main/20211007013434-cpt103.md

            -   [X] Test data 8 cases in
                -   [X] positivein Con 2021-10-04
                -   [X] positivein Cnot on 2021-10-04
                -   [X] positivenot in Con 2021-10-04
                -   [X] positivenot in Cnot on 2021-10-04
                -   [X] negativein Con 2021-10-04
                -   [X] negativein Cnot on 2021-10-04
                -   [X] negativenot in Con 2021-10-04
                -   [X] negativenot in Cnot on 2021-10-04
            -   [X] select statement
                -   [X] period chart
                -   [X] 对齐
                -   [X] make sure the man's positive
                -   [X] make sure the man's in centre lukewarm
                -   [X] make sure the man's collected at 2021-10-04
            -   [X] screenshot

        <!--list-separator-->

        - <span class="org-todo done DONE">DONE</span>  increment in a district

            -   [X] test dat a
            -   [ ] select
                -   [ ] all positive in 1 day
                -   [ ] count()
                -   [ ] minus
            -   [ ] screenshot

        <!--list-separator-->

        - <span class="org-todo todo TODO">TODO</span>  Spread rate

            -   [ ] test data
            -   [ ] select
            -   [ ] screenshot

    <!--list-separator-->

    -  Self-generated<code>[0/2]</code>

        Try have 2 tables placed together, and make some sence out of it.
        Inovation is a synonym for traversing through every possiblity.

        <!--list-separator-->

        - <span class="org-todo todo TODO">TODO</span>  How like to wander 1 people can be

        <!--list-separator-->

        - <span class="org-todo todo TODO">TODO</span>  How like to wander 1 district/region can be.


### <span class="org-todo done DONE">DONE</span> Assesment 1 and 2 {#assesment-1-and-2}


## Labs {#labs}


## Questions {#questions}


### <span class="org-todo todo TODO">TODO</span> What's super key? {#what-s-super-key}

Candidate key + other things


### <span class="org-todo todo TODO">TODO</span> Why is super key bad? {#why-is-super-key-bad}

other things aren't nessasary


### <span class="org-todo todo TODO">TODO</span> How to set a column unique and remove? {#how-to-set-a-column-unique-and-remove}


### <span class="org-todo todo TODO">TODO</span> select distinct? {#select-distinct}